app/controllers/projects_controller.rb

  def index
    @projects = Project.all.limit(6)
---
SELECT  "projects".* FROM "projects" ORDER BY "projects"."created_at" DESC LIMIT $1  [["LIMIT", 6]]

  def create
    @project = Project.new(project_params)
    if @project.save
---
INSERT INTO "projects" ("title", "desc", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Nicko"], ["desc", "is funny"], ["url", "happy.com"], ["created_at", "2018-04-30 08:31:23.225476"], ["updated_at", "2018-04-30 08:31:23.225476"]]

  def update
    @project= Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def destroy
    @project = Project.find(params[:id])
    if @project.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]